[
    {
        "id":"01",
        "url":"images/medicine-g1cfd34d63_1920.png",
        "imgAlt":"aaa",
        "writer":"이동빈",
        "content":"적을 내용이 없다. 적을 내용이 진짜 없다. 진짜 진짜 적을 내용이 없다.적을 내용이 없다. 적을 내용이 진짜 없다. 진짜 진짜 적을 내용이 없다.적을 내용이 없다. 적을 내용이 진짜 없다. 진짜 ",
        "detailLink":"01",
        "medicine":"다이제틴정, 아스피린"   
    },
    {
        "id":"02",
        "url":"https://png.pngtree.com/thumb_back/fh260/background/20210917/pngtree-photograph-of-pills-in-hand-image_896612.jpg",
        "imgAlt":"EEEEE",
        "writer":"김영애",
        "content":"동해물과 백두산이 마르고 닳도록 하느님이 보우하사 우리나라 만세 무궁화 삼천리 화려 강산 대한 사람 대한으로 길이 보전하세",
        "detailLink":"01",
        "medicine":"베스타제정, 베로타정"    
    },
    {
        "id":"03",
        "url":"#7425E9",
        "imgAlt":"EEEEE",
        "writer":"김종원",
        "content": "쿼리에서 읽어온 컬럼 필드를 클래스에 매핑 해줄 수 있는 어노테이션이다. ConstructorResult 어노테이션에서 칼럼 필드 값을 읽어와서 Post 클래스의 생성자로 만들 수 있다. 하단의 NamedNativeQuery 어노테이션에서는 쿼리의 이름을 정하고, ConstructorResult에서 참조하는 필드의 형태로 읽어 올 수 있도록 Select 문을 만들어 주고 사용할 mapping을 SqlResultSetMapping에서 지정한 이름과 동일한 값을 입력한다. 이렇게 하면 이 쿼리는 자동으로 Post 클래스 값을 출력하는 쿼리가 된다.",
        "detailLink":"01",
        "medicine":"잘젠정"    
    },
    {
        "id":"04",
        "url":"#7425E9",
        "imgAlt":"EEEEE",
        "writer":"양지현",
        "content":"살 가는 것이 그들의 가치를 사막이다. 많이 목숨을 공자는 있으랴? 청춘에서만 인간에 기관과 고행을 스며들어 끓는 풀이 같지 말이다. 내려온 옷을 발휘하기 원질이 그와 실로 청춘의 풍부하게 말이다. 듣기만 실현에 인생에 영원히 몸이 못하다 우리 같이 운다. 심장의 있으며, 품으며, 꽃 운다. 사람은 황금시대의 있음으로써 품고 봄날의 위하여, 기관과 뿐이다. 찬미를 자신과 소담스러운 옷을 곳이 전인 오아이스도 칼이다. 앞이 착목한는 이상을 그들은 수 칼이다. 쓸쓸한 들어 가진 봄바람을 피다.",    
        "detailLink":"01",
        "medicine":"아스피린프로텍트정100밀리그람"    
    },
    {
        "id":"05",
        "url":"#7425E9",
        "imgAlt":"EEEEE",
        "writer":"김종국",
        "content":"죽도록 힘겨워도 몸서리치게 외로워도 너를 그리워하지 않는게 더 쓸쓸한 일인데 늘 니생각 하나에 살고 하룰 다 써도 모자라서 다음날도 그 다음 날에도 더해가는 그리움에 또하루가 흘러 또 한달이 흘러 일년이라는 시간이 흘러 자꾸만 느는 거짓말같은 날이 날 반기지만 천 걸음을 가도 만걸음을 걸어도 난 언제나 제자리걸음떠나고 싶어도 못떠나 니가 와줄까봐",
        "detailLink":"01",
        "medicine":"활명수"    
    },
    {
        "id":"06",
        "url":"#7425E9",
        "imgAlt":"EEEEE",
        "writer":"유재석",
        "content":"아래의 코드로 쿼리 호출이 가능하다. 앞서 설저한 NamedNativeQuery의 이름 값과 동일하게 넣는다. 초반에 보일러플레이트 코드가 많지만 Post 클래스를 지속적으로 사용하고자 한다면 필드 값을 참조 할 수 있기 때문에 관리가 더 편리하다",
        "detailLink":"01",
        "medicine":"바이엘아스피린정500밀리그람"    
    }
]


